In [1]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1       Kimia      0     laki-laki   12C
1         2  Matematika     92     perempuan   12B
2         3      Fisika     66     laki-laki   12A
3         4     Geologi     50     laki-laki   12C
4         5     Biologi     76     perempuan   12B

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [2]:
# code here
print(df.loc[:, ['nilai', 'kelas']])
print(df.loc[5:10, ['nilai', 'kelas']])

    nilai kelas
0       0   12C
1      92   12B
2      66   12A
3      50   12C
4      76   12B
5      29   12A
6      31   12B
7      10   12B
8      34   12B
9      51   12A
10      8   12D
11     74   12A
12     26   12A
13      2   12D
14     62   12C
15     68   12C
16     45   12C
17     30   12D
18     62   12D
19     69   12B
    nilai kelas
5      29   12A
6      31   12B
7      10   12B
8      34   12B
9      51   12A
10      8   12D

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [3]:
# code here
ek=df.pelajaran=='Ekonomi'
fis=df.pelajaran=='Fisika'
print(df[(ek)|(fis)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
2          3    Fisika     66     laki-laki   12A
6          7    Fisika     31     laki-laki   12B
10        11    Fisika      8     perempuan   12D
11        12   Ekonomi     74     perempuan   12A
13        14   Ekonomi      2     perempuan   12D
15        16   Ekonomi     68     laki-laki   12C
16        17   Ekonomi     45     perempuan   12C

In [4]:
kim=df.pelajaran=='Kimia'
nilai50=df.nilai>50
print(df[(kim)&(nilai50)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
9         10     Kimia     51     laki-laki   12A
19        20     Kimia     69     perempuan   12B

In [5]:
nilai70=df.nilai>70
cwe=df['jenis-kelamin']=='perempuan'
kelas12C=df.kelas=='12C'
print(df[(nilai70)&(cwe)&(kelas12C)])

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [6]:
# code here
def x_norm(x):
    return (x-x.min()/(x.max()-x.min()))
print(df.nilai)
print(df[['nilai']].apply(x_norm))

0      0
1     92
2     66
3     50
4     76
5     29
6     31
7     10
8     34
9     51
10     8
11    74
12    26
13     2
14    62
15    68
16    45
17    30
18    62
19    69
Name: nilai, dtype: int64
    nilai
0     0.0
1    92.0
2    66.0
3    50.0
4    76.0
5    29.0
6    31.0
7    10.0
8    34.0
9    51.0
10    8.0
11   74.0
12   26.0
13    2.0
14   62.0
15   68.0
16   45.0
17   30.0
18   62.0
19   69.0